# Rating Stats
> Author: Sharnique Beck

This notebook looks at the stats

In [1]:
import pandas as pd

In [2]:
kr= pd.read_csv('./data/k_ratings_total.csv')
kt= pd.read_csv('./data/k_titles.csv')

In [3]:
kt['title'].nunique()

620

In [4]:
kr['title'].nunique()

618

In [5]:
kr.shape

(402426, 3)

In [6]:
kr['user'].nunique()

183650

In [7]:
kr.head()

   rating                 title                   user
0      10  Thirty But Seventeen                 la_fra
1      10  Thirty But Seventeen   jyotikababbar999_688
2      10  Thirty But Seventeen  lucianakarolina6b_700
3      10  Thirty But Seventeen               lsnowe05
4      10  Thirty But Seventeen         luisarreta_770

In [23]:
kr['title'].value_counts()

Strong Woman Do Bong Soon             16627
W                                     13774
Descendants of the Sun                13445
Weightlifting Fairy Kim Bok Joo       11744
What’s Wrong With Secretary Kim       10967
The Legend of the Blue Sea             9734
While You Were Sleeping                9091
I Am Not a Robot                       8058
Oh My Venus                            7845
She Was Pretty                         7747
Boys Over Flowers                      7656
Hwarang                                7514
Suspicious Partner                     6673
Because This Is My First Life          5686
My Love From the Star                  5404
Healer                                 4920
Just Between Lovers                    4814
Kill Me Heal Me                        4718
When Time Stopped                      4686
Hwayugi                                4663
Doctors                                4600
Moorim School                          3860
Splash Splash Love                     3843
Pinocchio                              3688
Moonlight Drawn by Clouds              3596
Cheer Up!                              3588
Who Are You                            3550
Rich Man, Poor Woman                   3510
Fight My Way                           3373
Playful Kiss                           3277
                                      ...
My Little Kitchen Season 2                5
Gloria                                    5
Why Couldn’t You Get Married?             5
Light and Shadow                          4
Merry Mary                                4
2016 DMC Festival                         4
Music Bank K-Chart                        4
YoGoBaLa                                  4
The Road to Seoul                         4
Little Too Crazy                          3
Section TV Entertainment News             3
2018 KBS Drama Awards                     3
LC9's Life of Research                    3
Moon Hee                                  3
My Little Television                      3
2018 Changwon K-POP World Festival        3
Pets GO! Doggy Trip                       3
DMCF 2018                                 2
E-news Exclusive                          2
2018 KBS Entertainment Awards             2
SBS Super Concert in Suwon                2
Auction House                             2
2018 KBS Drama Special                    2
Food Truck                                2
Again, My Love                            2
Modern Housewives                         2
2017 MBC Entertainment Awards             1
2017 SBS Entertainment Awards             1
On Air                                    1
Yu Huiyeol’s Sketchbook                   1
Name: title, Length: 618, dtype: int64

In [7]:
kr.head()

   rating                 title                   user
0      10  Thirty But Seventeen                 la_fra
1      10  Thirty But Seventeen   jyotikababbar999_688
2      10  Thirty But Seventeen  lucianakarolina6b_700
3      10  Thirty But Seventeen               lsnowe05
4      10  Thirty But Seventeen         luisarreta_770

In [8]:
user_ids = pd.DataFrame(kr['user'].value_counts()).reset_index().rename(columns={'index': 'user','user':'num'}).reset_index()
# user_ids.set_index(keys='user',inplace=True)

In [9]:
user_ids.drop('num', axis=1,inplace=True)

In [11]:
user_ids.rename(columns={'index':'user_id'}, inplace=True)

In [12]:
user_ids.head()

   user_id                    user
0        0  elizabethpereira37_167
1        1        dani_x_danek_920
2        2            kheevmhy_957
3        3          danyli_lari_25
4        4          caterina31_170

In [17]:
data=pd.merge(kr,user_ids)

In [18]:
data.head()

   rating                   title                  user  user_id
0      10    Thirty But Seventeen                la_fra    19253
1      10                       W                la_fra    19253
2      10  Descendants of the Sun                la_fra    19253
3      10            Fight My Way                la_fra    19253
4      10    Thirty But Seventeen  jyotikababbar999_688   143260

In [19]:
data.to_csv('./data/ratings_data.csv', index=False)